abstract class Parcell {
    String description;
    String deliveryAddress;
    double weight;
    int    sendDay;

    abstract void packageItem();            // упаковать
    // packageItem — «упаковать». Для стандартных и скоропортящихся посылок этот метод должен просто выводить на экран текст Посылка <<XXX>> упакована, а для хрупких посылок — строку Посылка <<XXX>> обёрнута в защитную плёнку, а затем Посылка <<XXX>> упакована, где XXX — описание посылки.
    abstract void diliver();                // отправить
    // deliver — «доставить». Этот метод будет осуществлять доставку посылки адресату. Он должен выводить на экран текст Посылка <<XXX>> доставлена по адресу YYY, где ХХХ — описание посылки, а YYY — адрес назначения.
    abstract double calculateDeliveryCost(); // рассчитать стоимость отправки
    // calculateDeliveryCost — «вычислить стоимость доставки». Стоимость доставки должна вычисляться следующим образом: вес посылки умножается на базовую стоимость одной единицы отправления. Базовая стоимость фиксирована для каждого типа посылок и равна 2 для стандартной посылки, 3 для скоропортящейся и 4 для хрупкой. Подумайте, как избежать дублирования кода при реализации этого метода для разных типов посылок.
    
}
