class PerishableParcel {        // скоропортящаяся посылка
    int timeToLive;             // срок годности
    public boolean isExpired() {
        // Если количество дней с момента отправки меньше или равно timeToLive, посылка считается целой, а если больше — испортившейся.
        //isExpired — метод должен присутствовать только у скоропортящихся посылок. На вход методу передаётся целое число currentDay — номер текущего дня месяца. Если сумма значения поля sendDay и timeToLive больше или равна currentDay, нужно вернуть false (посылка не испортилась), иначе — true (посылка испортилась). Возможный выход за пределы месяца можно игнорировать.
        return false; 
    }
}
